src_doc/Enums/ТипыДокументовЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДокументовЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктВзаимозачета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверкиВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ведомость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГарантийноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПриемкиЕИСУКД</Name>
					<Comment>Титул поставщика из ЕИС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПриемкиЕИСУПД</Name>
					<Comment>Титул поставщика из ЕИС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросКоммерческихПредложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОбОшибкеЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммерческоеПредложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрактЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС11</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиночитаемаяДоверенность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПродажахКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОСписанииКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеОператораЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредложениеОбАннулировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прикладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеКАкту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатРассмотренияАктаПриемкиЕИСУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатРассмотренияАктаПриемкиЕИСУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитыОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спецификация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварнаяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбУточнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПринятииКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктЗаказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВыпискаБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДопДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросЗонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНаОтзывЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНочнойВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИзвещениеОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКвитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеТребование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПроизвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПриемкиСтроительныхРаботУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УниверсальноеСобщение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_doc/CommonModules/ОбработкаЗапросовXDTOПереопределяемый/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Обработка запросов XDTO, переопределяемый
// Реализует расширяемый функционал веб-сервиса DMService
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Дополняет таблицу соответствия имен значений перечислений XDTO и объектов информационной базы.
// Вызывается из ОбработкаЗапросовXDTOПовтИсп.СоответствиеПеречислений.
//
// Параметры:
//   Таблица - ТаблицаЗначений - неявно возвращаемое значение с колонками:
//     * ИмяПеречисленияXDTO - Строка - имя перечисления XDTO.
//     * ЗначениеПеречисленияXDTO - Строка - значение перечисления XDTO.
//     * ЗначениеПеречисленияДО - ЛюбаяСсылка - ссылка на значение перечисления ДО, либо ссылка на предопределенный
//       элемент справочника ДО.
//
Процедура ДополнитьСоответствиеПеречислений(Таблица) Экспорт
	
// Локализация
#Область Перечисление_ТипыДокументовЭДО
	ИмяПеречисленияXDTO = "DMElectronicDocumentType";
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ActOfNetting",
		Перечисления.ТипыДокументовЭДО.АктВзаимозачета);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"AcceptanceCertificate",
		Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ActOfTransferringRights",
		Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ActOfDiscrepancy",
		Перечисления.ТипыДокументовЭДО.АктОРасхождениях);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ReconciliationAct",
		Перечисления.ТипыДокументовЭДО.АктСверки);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ActOfReviewOfMutualAccounts",
		Перечисления.ТипыДокументовЭДО.АктСверкиВзаиморасчетов);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"Statement",
		Перечисления.ТипыДокументовЭДО.Ведомость);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"Internal",
		Перечисления.ТипыДокументовЭДО.Внутренний);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ReturningOfGoods",
		Перечисления.ТипыДокументовЭДО.ВозвратТоваровМеждуОрганизациями);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"LetterOfGguarantee",
		Перечисления.ТипыДокументовЭДО.ГарантийноеПисьмо);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"Contract",
		Перечисления.ТипыДокументовЭДО.Договор);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ContractualDocument",
		Перечисления.ТипыДокументовЭДО.ДоговорныйДокумент);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"AcceptanceDocumentUISUCD",
		Перечисления.ТипыДокументовЭДО.ДокументПриемкиЕИСУКД);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"AcceptanceDocumentUISUTD",
		Перечисления.ТипыДокументовЭДО.ДокументПриемкиЕИСУПД);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"AdditionalAgreement",
		Перечисления.ТипыДокументовЭДО.ДополнительноеСоглашение);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"OrderOfGoods",
		Перечисления.ТипыДокументовЭДО.ЗаказТовара);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"CommercialOfferRequest",
		Перечисления.ТипыДокументовЭДО.ЗапросКоммерческихПредложений);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ErrorNotificationUIS",
		Перечисления.ТипыДокументовЭДО.ИзвещениеОбОшибкеЕИС);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ReceiptNotification",
		Перечисления.ТипыДокументовЭДО.ИзвещениеОПолучении);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"CatalogOfGoods",
		Перечисления.ТипыДокументовЭДО.КаталогТоваров);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"TicketUIS",
		Перечисления.ТипыДокументовЭДО.КвитанцияЕИС);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"CommercialOffer",
		Перечисления.ТипыДокументовЭДО.КоммерческоеПредложение);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ContractUIS",
		Перечисления.ТипыДокументовЭДО.КонтрактЕИС);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"AdjustmentOfInformationOnPurchaseByCommissionAgent",
		Перечисления.ТипыДокументовЭДО.КорректировкаСведенийОЗакупкеКомиссионером);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"AdjustmentOfInformationOnSalesByCommissionAgent",
		Перечисления.ТипыДокументовЭДО.КорректировкаСведенийОРеализацииКомиссионером);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"CorrectionInvoice",
		Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"KS11",
		Перечисления.ТипыДокументовЭДО.КС11);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"KS2",
		Перечисления.ТипыДокументовЭДО.КС2);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"KS3",
		Перечисления.ТипыДокументовЭДО.КС3);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"MachineReadablePowerOfAttorney",
		Перечисления.ТипыДокументовЭДО.МашиночитаемаяДоверенность);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ResponseToOrder",
		Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"AcceptanceCertificate",
		Перечисления.ТипыДокументовЭДО.ОтветНаЗаказ);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"Report",
		Перечисления.ТипыДокументовЭДО.Отчет);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ReportOnSalesOfCommissionGoods",
		Перечисления.ТипыДокументовЭДО.ОтчетОПродажахКомиссионногоТовара);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ReportOnWriteoffOfCommissionGoods",
		Перечисления.ТипыДокументовЭДО.ОтчетОСписанииКомиссионногоТовара);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"TransferOfGoodsBetweenCompanies",
		Перечисления.ТипыДокументовЭДО.ПередачаТоваровМеждуОрганизациями);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"PaymentOrder",
		Перечисления.ТипыДокументовЭДО.ПлатежноеПоручение);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"EDIOperatorConfirmation",
		Перечисления.ТипыДокументовЭДО.ПодтверждениеОператораЭДО);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"PriceList",
		Перечисления.ТипыДокументовЭДО.ПрайсЛист);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ProposalForRevocation",
		Перечисления.ТипыДокументовЭДО.ПредложениеОбАннулировании);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ApplicationDocument",
		Перечисления.ТипыДокументовЭДО.Прикладной);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"AnnexUIS",
		Перечисления.ТипыДокументовЭДО.ПриложениеДляЕИС);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"AnnexToAct",
		Перечисления.ТипыДокументовЭДО.ПриложениеКАкту);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"Other",
		Перечисления.ТипыДокументовЭДО.Прочее);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ResultOfReviewActOfAcceptanceUISUCD",
		Перечисления.ТипыДокументовЭДО.РезультатРассмотренияАктаПриемкиЕИСУКД);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ResultOfReviewActOfAcceptanceUISUTD",
		Перечисления.ТипыДокументовЭДО.РезультатРассмотренияАктаПриемкиЕИСУПД);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"DetailsOfOrganization",
		Перечисления.ТипыДокументовЭДО.РеквизитыОрганизации);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"InformationOnPurchaseByCommissionAgent",
		Перечисления.ТипыДокументовЭДО.СведенияОЗакупкеКомиссионером);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"InformationOnSalesByCommissionAgent",
		Перечисления.ТипыДокументовЭДО.СведенияОРеализацииКомиссионером);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"PriceChangeAgreement",
		Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"EDIAgreement",
		Перечисления.ТипыДокументовЭДО.СоглашениеОбЭДО);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"Specification",
		Перечисления.ТипыДокументовЭДО.Спецификация);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"InvoiceForPayment",
		Перечисления.ТипыДокументовЭДО.СчетНаОплату);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"Invioce",
		Перечисления.ТипыДокументовЭДО.СчетФактура);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ConsignmentNote",
		Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"Notification",
		Перечисления.ТипыДокументовЭДО.Уведомление);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotificationOfClarification",
		Перечисления.ТипыДокументовЭДО.УведомлениеОбУточнении);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotificationOfAcceptanceForAccounting",
		Перечисления.ТипыДокументовЭДО.УведомлениеОПринятииКУчету);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"UCD",
		Перечисления.ТипыДокументовЭДО.УКД);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedServiceAct",
		Перечисления.ТипыДокументовЭДО.УдалитьАктЗаказчик);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedServiceActCustomer",
		Перечисления.ТипыДокументовЭДО.УдалитьАктИсполнитель);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedBankStatement",
		Перечисления.ТипыДокументовЭДО.УдалитьВыпискаБанка);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedAdditionalData",
		Перечисления.ТипыДокументовЭДО.УдалитьДопДанные);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedStatementRequest",
		Перечисления.ТипыДокументовЭДО.УдалитьЗапросВыписки);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedRequestProbe",
		Перечисления.ТипыДокументовЭДО.УдалитьЗапросЗонд);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedEDRevocationRequest",
		Перечисления.ТипыДокументовЭДО.УдалитьЗапросНаОтзывЭД);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedNightStatementRequest",
		Перечисления.ТипыДокументовЭДО.УдалитьЗапросНочнойВыписки);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedEDStatusRequest",
		Перечисления.ТипыДокументовЭДО.УдалитьЗапросОСостоянииЭД);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedEDStatusNotification",
		Перечисления.ТипыДокументовЭДО.УдалитьИзвещениеОСостоянииЭД);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedReceipt",
		Перечисления.ТипыДокументовЭДО.УдалитьКвитанция);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedError",
		Перечисления.ТипыДокументовЭДО.УдалитьОшибка);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedPaymentOrder",
		Перечисления.ТипыДокументовЭДО.УдалитьПлатежноеПоручение);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedPaymentClaim",
		Перечисления.ТипыДокументовЭДО.УдалитьПлатежноеТребование);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedArbitraryDocument",
		Перечисления.ТипыДокументовЭДО.УдалитьПроизвольный);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedPriceChangeAgreementRecipient",
		Перечисления.ТипыДокументовЭДО.УдалитьСоглашениеОбИзмененииСтоимостиПолучатель);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedTRADE12",
		Перечисления.ТипыДокументовЭДО.УдалитьТОРГ12);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedCommodityInvoiceCustomer",
		Перечисления.ТипыДокументовЭДО.УдалитьТОРГ12Покупатель);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedUCDCustomerInformation",
		Перечисления.ТипыДокументовЭДО.УдалитьУКД_ИнформацияПокупателя);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedUCDSellerInformation",
		Перечисления.ТипыДокументовЭДО.УдалитьУКД_ИнформацияПродавца);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedUTDCustomerInformation",
		Перечисления.ТипыДокументовЭДО.УдалитьУПД_ИнформацияПокупателя);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"NotUsedUTDSellerInformation",
		Перечисления.ТипыДокументовЭДО.УдалитьУПД_ИнформацияПродавца);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"UTD",
		Перечисления.ТипыДокументовЭДО.УПД);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"EPO",
		Перечисления.ТипыДокументовЭДО.ЭЗН);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ECS",
		Перечисления.ТипыДокументовЭДО.ЭСВ);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"EOA",
		Перечисления.ТипыДокументовЭДО.ЭЗЗ);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"AcceptanceCertificateOfConstructionWorksAndServices",
		Перечисления.ТипыДокументовЭДО.АктПриемкиСтроительныхРаботУслуг);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"EBL",
		Перечисления.ТипыДокументовЭДО.ЭТрН);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ETT",
		Перечисления.ТипыДокументовЭДО.ЭПЛ);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"ECA",
		Перечисления.ТипыДокументовЭДО.ЭДФ);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"Document",
		Перечисления.ТипыДокументовЭДО.ДокументПредприятия);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"AddInformationOnAcceptanceResult",
		Перечисления.ТипыДокументовЭДО.ДопСведенияПоРезультатамПриемки);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"UniversalMessage",
		Перечисления.ТипыДокументовЭДО.УниверсальноеСобщение);
#КонецОбласти
#Область Перечисление_ВидыОбращенийГраждан
	ИмяПеречисленияXDTO = "DMTypesOfAppealsOfCitizens";
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"Personal",
		Перечисления.ВидыОбращенийГраждан.Персональное);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"Cooperative",
		Перечисления.ВидыОбращенийГраждан.Коллективное);
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияПеречислений(
		Таблица,
		ИмяПеречисленияXDTO,
		"Anonymous",
		Перечисления.ВидыОбращенийГраждан.Анонимное);
#КонецОбласти
// Локализация Конец
	
КонецПроцедуры

// Дополняет таблицу соответствия поддерживаемых типов.
// Вызывается из ОбработкаЗапросовXDTOПовтИсп.СоответствиеТипов.
//
// Параметры:
//   Таблица - ТаблицаЗначений - неявно возвращаемое значение с колонками:
//     * ИмяXDTO - Строка - имя типа XDTO.
//     * ИмяДО - Строка - полное имя типа ДО.
//
Процедура ДополнитьСоответствиеТипов(Таблица) Экспорт
	

// Локализация
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияТипов(Таблица, "DMEDIMessageAttachedFile", "Справочник.СообщениеЭДОПрисоединенныеФайлы");
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияТипов(Таблица, "DMElectronicDocumentKind", "Справочник.ВидыДокументовЭДО");
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияТипов(Таблица, "DMElectronicDocumentType", "Перечисление.ТипыДокументовЭДО");
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияТипов(Таблица, "DMIncomingElectronicDocument", "Документ.ЭлектронныйДокументВходящийЭДО");
	ОбработкаЗапросовXDTO.ДобавитьСтрокуСоответствияТипов(Таблица, "DMOutgoingElectronicDocument", "Документ.ЭлектронныйДокументИсходящийЭДО");
// Локализация Конец
	
КонецПроцедуры

// Вызывается при заполнении объекта Документооборота по данным объекта XDTO.
//
// Параметры:
//   ОбъектДО - СправочникОбъект - заполняемый объект.
//   ОбъектXDTO - ОбъектXDTO - объект XDTO соответствующего типа. Источник данных заполнения.
//   ТипXDTOОбъекта - Строка - имя типа XDTO объекта, из которого требуется заполнить объект ДО.
//   СтандартнаяОбработка - Булево - признак отказа от стандартной обработки.
//
Процедура ПриЗаполненииДанныхОбъектаДО(ОбъектДО, ОбъектXDTO, ТипXDTOОбъекта, СтандартнаяОбработка) Экспорт
	

// Локализация
	Если ТипXDTOОбъекта = "DMIncomingElectronicDocument" Или ТипXDTOОбъекта = "DMOutgoingElectronicDocument" Тогда
		ОбработкаЗапросовXDTOЛокализация.ЗаполнитьДанныеДокументаЭДО(ОбъектДО, ОбъектXDTO);
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли ТипXDTOОбъекта = "DMEDIMessageAttachedFile" Тогда
		ОбработкаЗапросовXDTOЛокализация.ЗаполнитьДанныеПрисоединенногоФайлаСообщенияЭДО(ОбъектДО, ОбъектXDTO);
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
// Локализация Конец
	
КонецПроцедуры

// Вызывается при заполнении соответствия имен свойств XDTO реквизитам поиска и позволяет доопределить его.
//
// Параметры:
//   Тип - Строка - имя типа XDTO.
//   Результат - Структура - где ключом является имя свойства XDTO, а значением имя реквизита.
//
Процедура ПриЗаполненииСоответствияСвойствXDTOРезультатамПоиска(Тип, Результат) Экспорт
	
	Если Тип = "DMDataExchangeNode" Тогда
		Результат.Вставить("databaseName", "ИмяБазы");
	КонецЕсли;
	
КонецПроцедуры

// Дополнительная обработка сообщения XDTO.
// Вызывается из ОбработкаЗапросовXDTO.ОбработатьУниверсальноеСообщение перед основной обработкой.
//
// Параметры:
//   Сообщение - ОбъектXDTO - объект XDTO, потомок DMRequest.
//   Результат - ОбъектXDTO - объект XDTO, потомок DMResponse, если сообщение обработано.
//
Процедура ПриОбработкеУниверсальногоСообщения(Сообщение, Результат) Экспорт
	

КонецПроцедуры

// Определяет необходимость использования механизма обмена данными с интегрированными системами.
//
// Параметры:
//   Используется - Булево - неявно возвращаемое значение, указывает используется ли механизм обмена данными.
//
Процедура ПриОпределенииИспользованияОбменаДаннымиСИнтегрированнымиСистемами(Используется) Экспорт
	
	Используется = ОбменДаннымиДокументооборотПовтИсп.ЭтоЦентральныйУзел();
	
КонецПроцедуры

// Вызывается при определении набора колонок, в котором задаются ключевые реквизиты объекта XDTO, которые могут
// потребоваться на стороне интегрированной системы при подборе или создании объектов ИС на основании объектов ДО.
//
// Параметры:
//   НаборКолонок - Массив из Строка - массив имен ключевых реквизитов объекта XDTO.
//   ОбъектДО - СправочникОбъект - объект Документооборота, источник данных.
//   ОбъектXDTO - ОбъектXDTO - объект XDTO который требуется дополнить.
//   ТипРеквизита - Тип - тип объекта Документооборота.
//   ТипXDTOОбъекта - Строка - имя типа XDTO объекта.
//
Процедура ПриОпределенииНабораКолонокДляЗаполненияКлючевыхРеквизитовОбъектаXDTO(НаборКолонок, ОбъектДО, ОбъектXDTO,
		ТипРеквизита, ТипXDTOОбъекта) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при определении поля, где будет возвращаться наименование, для запроса на получение списка объектов.
//
// Параметры:
//   ПолеНаименования - Строка - неявно возвращаемое значение, указывает где брать наименование объектов.
//   ИмяТипа - Строка - полное имя типа Документооборота.
//
Процедура ПриОпределенииПоляНаименования(ПолеНаименования, ИмяТипа) Экспорт
	
	Если ИмяТипа = "Справочник.Сотрудники" Тогда
		ПолеНаименования = "Представление(ОбъектВыборки.Ссылка)";
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при определении постфикса версии сервиса ДО.
//
// Параметры:
//   Постфикс - Строка - неявно возвращаемое значение, постфикса версии сервиса ДО.
//   ИнтегрированнаяСистема - ПланОбменаСсылка.ИнтегрированныеСистемы - система, для интеграции с которой требуется
//     определить постфикс версии сервиса ДО.
//
Процедура ПриОпределенииПостфиксаВерсииСервиса(Постфикс, ИнтегрированнаяСистема) Экспорт
	
	Постфикс = ".CORP";
	

КонецПроцедуры

// Позволяет переопределить имя типа объекта веб-сервиса Документооборота.
//
// Параметры:
//   ИмяТипаXDTO - Строка - имя типа, которое требуется преобразовать.
//
Процедура ПриОпределенииТипаXDTO(ИмяТипаXDTO) Экспорт
	
	Если ИмяТипаXDTO = "DMInternalDocument"
			Или ИмяТипаXDTO = "DMIncomingDocument"
			Или ИмяТипаXDTO = "DMOutgoingDocument" Тогда
		ИмяТипаXDTO = "DMDocument";
		
	ИначеЕсли ИмяТипаXDTO = "DMInternalDocumentType"
			Или ИмяТипаXDTO = "DMIncomingDocumentType"
			Или ИмяТипаXDTO = "DMOutgoingDocumentType" Тогда
		ИмяТипаXDTO = "DMDocumentType";
		
	ИначеЕсли ИмяТипаXDTO = "DMInternalDocumentTemplate"
			Или ИмяТипаXDTO = "DMIncomingDocumentTemplate"
			Или ИмяТипаXDTO = "DMOutgoingDocumentTemplate" Тогда
		ИмяТипаXDTO = "DMDocumentTemplate";
		
	ИначеЕсли ИмяТипаXDTO = "DMInternalDocumentFolder" Тогда
		ИмяТипаXDTO = "DMDocumentFolder";
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при поиске подходящего объекта Документооборота по объекту XDTO.
//
// Параметры:
//   ОбъектXDTO - ОбъектXDTO - объект XDTO соответствующего типа.
//   ТипXDTOОбъекта - Строка - имя типа XDTO объекта, который требуется найти.
//   ПолноеИмяТипаОбъектаДО - Строка - имя типа объекта ДО.
//   Владелец - СправочникСсылка - владелец объекта, который требуется найти.
//   Результат - ЛюбаяСсылка - найденный объект Документооборота.
//
Процедура ПриПоискеОбъектаДОПоСтандартнымПолямПоиска(ОбъектXDTO, ТипXDTOОбъекта, ПолноеИмяТипаОбъектаДО, Владелец,
		Результат) Экспорт
	

// Локализация
	Если ТипXDTOОбъекта = "DMIncomingElectronicDocument" Или ТипXDTOОбъекта = "DMOutgoingElectronicDocument" Тогда
		Результат = ОбработкаЗапросовXDTOЛокализация.НайтиДокументЭДО(ОбъектXDTO);
		
	ИначеЕсли ТипXDTOОбъекта = "DMEDIMessageAttachedFile" Тогда
		Результат = ОбработкаЗапросовXDTOЛокализация.НайтиПрисоединенныйФайлСообщенияЭДО(ОбъектXDTO);
	
	КонецЕсли;
// Локализация Конец
	
КонецПроцедуры

// Вызывается при получении данных документа для формирования обзора.
//
// Параметры:
//   Документ - СправочникОбъект.ДокументыПредприятия - исходный документ.
//   КэшВидаДокумента - см. Делопроизводство.КэшВидаДокумента
//   Данные - Структура - неявно возвращаемое значение, содержит структуру данных документа,
//     необходимую для формирования обзора на документ.
//
Процедура ПриПолученииДанныхДокументаДляФормированияОбзора(Документ, КэшВидаДокумента, Данные) Экспорт
	
// Локализация
	Данные.Вставить("ВопросыОбращения", НовыйТаблицаВопросыОбращения());
	Данные.Вставить("СвязанныеДокументыПоВопросам", НовыйТаблицаСвязанныеДокументыПоВопросам());
	Данные.Вставить("ГотовоКВыгрузкеССТУ", Ложь);
	Данные.Вставить("РегламентированныйУчетОбращений", ПолучитьФункциональнуюОпцию("РегламентированныйУчетОбращений"));
	Данные.Вставить("Раздел", Справочники.РазделыОбращений.ПустаяСсылка());
	Данные.Вставить("Вопрос", Справочники.ВопросыОбращений.ПустаяСсылка());
	Данные.Вставить("Тематика", Справочники.ТематикиОбращений.ПустаяСсылка());
	Данные.Вставить("Тема", Справочники.ТемыОбращений.ПустаяСсылка());
	Данные.Вставить("ОрганДляПередачи", Справочники.Контрагенты.ПустаяСсылка());
	Данные.Вставить("РезультатРассмотрения", Перечисления.РезультатыРассмотренияОбращений.ПустаяСсылка());
	Данные.Вставить("СопроводительныйДокумент", Справочники.ДокументыПредприятия.ПустаяСсылка());
	Данные.Вставить("СопроводительныйДокументСтрока", "");
	Данные.Вставить("ОтветныйДокумент", Справочники.ДокументыПредприятия.ПустаяСсылка());
	Данные.Вставить("ОтветныйДокументСтрока", "");
	Данные.Вставить("ДатаОтвета", '00010101');
	Данные.Вставить("КодВопроса", "");
	Данные.Вставить("МнениеАвтораОРезультатах", "");
	Данные.Вставить("МнениеАвтораОМерах", "");
	Данные.Вставить("НесколькоВопросов", Ложь);
	Данные.Вставить("КоличествоВопросовОбращения", 0);
	Данные.Вставить("ВидОбращения", Неопределено);
	Данные.Вставить("Повторное", Неопределено);
	Данные.Вставить("Дубликат", Неопределено);
	Данные.Вставить("ПервичноеОбращение", Неопределено);
	Данные.Вставить("ОсновноеОбращение", Неопределено);
	
	Данные.Вставить("СостояниеЭДО", "");
	Если ОбщегоНазначенияБЭД.ЗначениеФункциональнойОпции("ИспользоватьОбменЭД") Тогда
		Данные.СостояниеЭДО = ОбменЭДОДокументооборот.СостояниеДокументаДО(Документ.Ссылка);
	КонецЕсли;
// Локализация Конец
	
КонецПроцедуры

// Вызывается при заполнении объекта XDTO по данным объекта Документооборота.
//
// Параметры:
//   ОбъектДО - СправочникОбъект - объект Документооборота, источник данных.
//   ОбъектXDTO - ОбъектXDTO - объект XDTO соответствующего типа.
//   ТипXDTOОбъекта - Строка - имя типа XDTO объекта, который требуется получить.
//   НаборКолонок - Массив из Строка - массив имен реквизитов к заполнению.
//                - Неопределено - требование заполнить все реквизиты.
//   ИнтегрированнаяСистема - ПланОбменаСсылка.ИнтегрированныеСистемы - система, для которой предназначен объект.
//   ТолькоОсновныеРеквизиты - Булево - объект XDTO будет заполнен всеми реквизитами объекта ДО, без дополнительных
//     запросов к базе.
//   КешДанных - см. ОбработкаЗапросовXDTOБизнесПроцессыИЗадачи.ДополнитьДанныеЗадачИСформироватьКешДанных
//   СтандартнаяОбработка - Булево - признак отказа от стандартной обработки.
//
Процедура ПриПолученииДанныхОбъектаДО(ОбъектДО, ОбъектXDTO, ТипXDTOОбъекта, НаборКолонок, ИнтегрированнаяСистема,
		ТолькоОсновныеРеквизиты, КешДанных, СтандартнаяОбработка) Экспорт
	

// Локализация
	Если ТипXDTOОбъекта = "DMIncomingElectronicDocument" Или ТипXDTOОбъекта = "DMOutgoingElectronicDocument" Тогда
		ОбработкаЗапросовXDTOЛокализация.ПолучитьДанныеДокументаЭДО(ОбъектДО, ОбъектXDTO, НаборКолонок);
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли ТипXDTOОбъекта = "DMEDIMessageAttachedFile" Тогда
		ОбработкаЗапросовXDTOЛокализация.ПолучитьДанныеПрисоединенногоФайлаСообщенияЭДО(
			ОбъектДО,
			ОбъектXDTO,
			НаборКолонок);
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
// Локализация Конец
	
КонецПроцедуры

// Вызывается при установке параметров сеанса.
//
// Параметры:
//   ИменаПараметровСеанса - Массив из Строка
//                         - Неопределено - имена параметров сеанса для инициализации.
//                                          Массив устанавливаемых идентификаторов параметров сеанса,
//                                          которые нужно инициализировать, если обработчик вызывается
//                                          перед использованием неинициализированных параметров сеанса.
//                                          Неопределено, если обработчик события вызывается системой при начале сеанса.
//
Процедура ПриУстановкеПараметровСеанса(ИменаПараметровСеанса) Экспорт
	
	Если ИменаПараметровСеанса = Неопределено
			Или ИменаПараметровСеанса.Найти("УзелИнтегрированнойСистемы") <> Неопределено Тогда
		ПараметрыСеанса.УзелИнтегрированнойСистемы = ПланыОбмена.ИнтегрированныеСистемы.ПустаяСсылка();
	КонецЕсли;

	Если ИменаПараметровСеанса = Неопределено
			Или ИменаПараметровСеанса.Найти("ВерсияБИД") <> Неопределено Тогда
		ПараметрыСеанса.ВерсияБИД = "";
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при формировании текста ошибки получения ссылки на объект ДО по ObjectID.
//
// Параметры:
//   ТекстОшибки - Строка - текст сообщения об ошибке.
//
Процедура ПриФормированииТекстаОшибкиПолученияСсылкиПоObjectID(ТекстОшибки) Экспорт
	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Локализация

// Конструктор таблицы значений для заполнения вопросов обращения.
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//     * Вопрос - СправочникСсылка.ВопросыОбращений
//     * ДатаОтвета - Дата
//     * Документ - Строка
//     * КодВопроса - Строка
//     * МнениеАвтораОМерах - Строка
//     * МнениеАвтораОРезультатах - Строка
//     * ОрганДляПередачи - СправочникСсылка.КонтактныеЛица
//     * ОтветныйДокумент - СправочникСсылка.ДокументыПредприятия
//     * ОтветныйДокументСтрока - Строка
//     * Раздел - СправочникСсылка.РазделыОбращений
//     * РезультатРассмотрения - ПеречислениеСсылка.РезультатыРассмотренияОбращений
//     * СопроводительныйДокумент - СправочникСсылка.ДокументыПредприятия
//     * СопроводительныйДокументСтрока - Строка
//     * Тема - СправочникСсылка.ТемыОбращений
//     * Тематика - СправочникСсылка.ТематикиОбращений
//
Функция НовыйТаблицаВопросыОбращения()
	
	ВопросыОбращения = Новый ТаблицаЗначений();
	ВопросыОбращения.Колонки.Добавить("Вопрос", Новый ОписаниеТипов(
		"СправочникСсылка.ВопросыОбращений"));
	ВопросыОбращения.Колонки.Добавить("ДатаОтвета", Новый ОписаниеТипов("Дата"));
	ВопросыОбращения.Колонки.Добавить("Документ", Новый ОписаниеТипов("Строка"));
	ВопросыОбращения.Колонки.Добавить("КодВопроса", Новый ОписаниеТипов("Строка"));
	ВопросыОбращения.Колонки.Добавить("МнениеАвтораОМерах", Новый ОписаниеТипов("Строка"));
	ВопросыОбращения.Колонки.Добавить("МнениеАвтораОРезультатах", Новый ОписаниеТипов("Строка"));
	ВопросыОбращения.Колонки.Добавить("ОрганДляПередачи", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ВопросыОбращения.Колонки.Добавить("ОтветныйДокумент",
		Новый ОписаниеТипов("СправочникСсылка.ДокументыПредприятия"));
	ВопросыОбращения.Колонки.Добавить("ОтветныйДокументСтрока", Новый ОписаниеТипов("Строка"));
	ВопросыОбращения.Колонки.Добавить("Раздел", Новый ОписаниеТипов("СправочникСсылка.РазделыОбращений"));
	ВопросыОбращения.Колонки.Добавить("РезультатРассмотрения",
		Новый ОписаниеТипов("ПеречислениеСсылка.РезультатыРассмотренияОбращений"));
	ВопросыОбращения.Колонки.Добавить("СопроводительныйДокумент",
		Новый ОписаниеТипов("СправочникСсылка.ДокументыПредприятия"));
	ВопросыОбращения.Колонки.Добавить("СопроводительныйДокументСтрока", Новый ОписаниеТипов("Строка"));
	ВопросыОбращения.Колонки.Добавить("Тема", Новый ОписаниеТипов("СправочникСсылка.ТемыОбращений"));
	ВопросыОбращения.Колонки.Добавить("Тематика", Новый ОписаниеТипов("СправочникСсылка.ТематикиОбращений"));
	
	Возврат ВопросыОбращения;
	
КонецФункции

// Конструктор таблицы значений для заполнения связанных документов по вопросам.
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//     * Вопрос - СправочникСсылка.ВопросыОбращений
//     * ДатаРегистрации - Дата
//     * ОтветныйДатаРегистрации - Дата
//     * ОтветныйДокумент - СправочникСсылка.ДокументыПредприятия
//     * ОтветныйДокументСтрока - Строка
//     * ОтветныйРегистрационныйНомер - Строка
//     * РегистрационныйНомер - Строка
//     * СопроводительныйДокумент - СправочникСсылка.ДокументыПредприятия
//     * СопроводительныйДокументСтрока - Строка
//
Функция НовыйТаблицаСвязанныеДокументыПоВопросам()
	
	СвязанныеДокументыПоВопросам = Новый ТаблицаЗначений();
	СвязанныеДокументыПоВопросам.Колонки.Добавить("Вопрос", Новый ОписаниеТипов("СправочникСсылка.ВопросыОбращений"));
	СвязанныеДокументыПоВопросам.Колонки.Добавить("ДатаРегистрации", Новый ОписаниеТипов("Дата"));
	СвязанныеДокументыПоВопросам.Колонки.Добавить("ОтветныйДатаРегистрации", Новый ОписаниеТипов("Дата"));
	СвязанныеДокументыПоВопросам.Колонки.Добавить("ОтветныйДокумент",
		Новый ОписаниеТипов("СправочникСсылка.ДокументыПредприятия"));
	СвязанныеДокументыПоВопросам.Колонки.Добавить("ОтветныйДокументСтрока", Новый ОписаниеТипов("Строка"));
	СвязанныеДокументыПоВопросам.Колонки.Добавить("ОтветныйРегистрационныйНомер", Новый ОписаниеТипов("Строка"));
	СвязанныеДокументыПоВопросам.Колонки.Добавить("РегистрационныйНомер", Новый ОписаниеТипов("Строка"));
	СвязанныеДокументыПоВопросам.Колонки.Добавить("СопроводительныйДокумент",
		Новый ОписаниеТипов("СправочникСсылка.ДокументыПредприятия"));
	СвязанныеДокументыПоВопросам.Колонки.Добавить("СопроводительныйДокументСтрока", Новый ОписаниеТипов("Строка"));
	
	Возврат СвязанныеДокументыПоВопросам;
	
КонецФункции

// Локализация Конец

#КонецОбласти
